## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [1]:
import pandas as pd  # Import the neccesarry libraries to work with and manipulate the data
import numpy as np
import seaborn as sns

In [58]:
pd.set_option('display.float_format', lambda x: '%.1f' % x)

In [2]:
# Read the Box Office Mojo Gross Cncome csv file in pandas dataframe 
bom_gross = pd.read_csv('zippeddata/bom.movie_gross.csv')

In [21]:
bom_gross.head()  # look at the first five entries

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [52]:
bom_gross.dtypes

title              object
studio             object
domestic_gross    float64
foreign_gross     float64
year                int64
dtype: object

In [37]:
bom_gross.shape

(3387, 5)

In [47]:
bom_gross.isnull().sum()

title             0
studio            5
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [35]:
foreign_films = bom_gross[bom_gross.domestic_gross.isnull()]
foreign_films.head()

,title,studio,domestic_gross,foreign_gross,year
230,It's a Wonderful Afterlife,UTV,NaN,1300000,2010
298,Celine: Through the Eyes of the World,Sony,NaN,119000,2010
302,White Lion,Scre.,NaN,99600,2010
306,Badmaash Company,Yash,NaN,64400,2010
327,Aashayein (Wishes),Relbig.,NaN,3800,2010

In [34]:
no_foreign = bom_gross[bom_gross.foreign_gross.isnull()]
no_foreign.head()

,title,studio,domestic_gross,foreign_gross,year
222,Flipped,WB,1800000.0,NaN,2010
254,The Polar Express (IMAX re-issue 2010),WB,673000.0,NaN,2010
267,Tiny Furniture,IFC,392000.0,NaN,2010
269,Grease (Sing-a-Long re-issue),Par.,366000.0,NaN,2010
280,Last Train Home,Zeit.,288000.0,NaN,2010

In [50]:
bom_gross.foreign_gross.nunique()

1204

In [14]:
bom_gross['foreign_gross'] = bom_gross.foreign_gross.str.strip()

In [18]:
bom_gross.foreign_gross.isnull().sum()

1350

In [44]:
bom_gross['foreign_gross'].fillna(value = 0, inplace = True)

In [46]:
bom_gross['domestic_gross'].fillna(value = 0, inplace = True)

In [49]:
bom_gross.foreign_gross = bom_gross.foreign_gross.str.replace(',','')

In [51]:
bom_gross.foreign_gross = bom_gross.foreign_gross.astype(float)

In [56]:
bom_gross['worldwide_gross'] = bom_gross['domestic_gross'] + bom_gross['foreign_gross']

In [59]:
bom_gross.head()

,title,studio,domestic_gross,foreign_gross,year,worldwide_gross
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1067000000.0
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1025500000.0
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,960300000.0
3,Inception,WB,292600000.0,535700000.0,2010,828300000.0
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,752600000.0

In [88]:
bom_gross.year.value_counts(sort=False)

2010    328
2012    400
2014    395
2016    436
2018    308
2011    399
2013    350
2015    450
2017    321
Name: year, dtype: int64

In [89]:
bom_gross.groupby('year').worldwide_gross.mean()

year
2010    78111773.6
2011    87326780.5
2012   110943005.2
2013   132542658.0
2014   113949375.2
2015   135857724.1
2016   153788382.0
2017   171728654.0
2018   163230345.5
Name: worldwide_gross, dtype: float64